Catalogs/Резервы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Резервы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРезервов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятиеКВычетуПоНалоговомуУчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БазовыеВидыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыРезервов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСомнительнымДолгам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодОбесцениваниеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВознаграждениямРаботникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПокрытиеИныхЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Резервы/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью" документа.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	

	Если ВидРезерва = Перечисления.ВидыРезервов.ПоВознаграждениямРаботникам Тогда
		// проверим, чтобы не было в табличной части двух одинаковых видов расчета
		ТаблицаДляПроверки = БазовыеВидыРасчета.Выгрузить();
		
		ТаблицаДляПроверки.Колонки.Добавить("КоличествоВР");
		ТаблицаДляПроверки.ЗаполнитьЗначения(1, "КоличествоВР");
		ТаблицаДляПроверки.Свернуть("ВидРасчета", "КоличествоВР");
		
		Для Каждого СтрокаТЗ Из ТаблицаДляПроверки Цикл
			Если СтрокаТЗ.КоличествоВР > 1 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Вид расчета '" + СтрокаТЗ.ВидРасчета + "' указан в качестве базового вида расчета " + СтрокаТЗ.КоличествоВР + " раз(а)!", Отказ, "", СтатусСообщения.Важное);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
